#Напишите программу, которая определяет, является число четным или нечетным.

i=int(input())
if i % 2 == 0:
    print('Четное')
else:
    print('Нечетное')